package Lecture;
//✈️✈️✈️✈️✈️✈️✈️✈️✈️✈️✈️✈️✈️✈️--------------Q9------------✈️✈️✈️✈️✈️✈️✈️✈️✈️✈️✈️✈️✈️✈️✈️✈️✈️✈️✈️✈️️✈️✈️✈️️✈️✈️✈️✈️✈️
//public class Exam {
//    public static void main(String[] args) {
//        //NO Output
//
//        int i;
//
//        for (i = 1; i <= 12; i += 2) {
//
//            if (i == 8) {
//
//                System.out.println(i);
//
//                break;
//            }
//        }
//    }
//}
//〰️〰️〰️〰️〰️〰️〰️〰️〰️〰️〰️〰️〰️〰️〰️〰️〰️〰️〰️〰️〰️〰️〰️〰️〰️〰️〰️〰️〰️〰️〰️〰️〰️〰️〰️〰️〰️〰️〰️〰️〰️〰️〰️〰️〰️〰️〰️〰️〰️〰️〰️〰️〰️




//🥟🥟🥟🥟🥟🥟🥟🥟🥟🥟🥟🥟🥟🥟🥟🥟🥟----------Q25-----------🥟🥟🥟🥟🥟🥟🥟🥟🥟🥟🥟🥟🥟🥟🥟🥟🥟🥟🥟🥟🥟🥟🥟🥟🥟🥟
//class ThisKeyword {
//    private int a = 4;
//    private int b = 1;
//    void getSum(int a, int b) {
//        this.a = a;
//        this.b = b;
//        System.out.println(this.a + this.b);
//    }
//}
//public class Exam {
//
//    public static void main(String args[]) {
//        ThisKeyword T = new ThisKeyword();
//        T.getSum(3, 5);
//    }
//}
//〰️〰️〰️〰️〰️〰️〰️〰️〰️〰️〰️〰️〰️〰️〰️〰️〰️〰️〰️〰️〰️〰️〰️〰️〰️〰️〰️〰️〰️〰️〰️〰️〰️〰️〰️〰️〰️〰️〰️〰️〰️〰️〰️〰️〰️〰️〰️〰️〰️〰️〰️〰️





//💉💉💉💉💉💉💉💉💉💉💉💉💉💉💉💉-------Q33---------------------💉💉💉💉💉💉💉💉💉💉💉💉💉💉💉💉💉💉💉💉💉💉💉💉
//public class Exam {
//    public static void main(String[] args) {
//        String str1 = "include";
//        String str2 = "help";
//        System.out.println(str1 + str2);  //includehelp
//    }
//}
//〰️〰️〰️〰️〰️〰️〰️〰️〰️〰️〰️〰️〰️〰️〰️〰️〰️〰️〰️〰️〰️〰️〰️〰️〰️〰️〰️〰️〰️〰️〰️〰️〰️〰️〰️〰️〰️〰️〰️〰️〰️〰️〰️〰️〰️〰️〰️〰️〰️〰️〰️






//🥟🥟🥟🥟🥟🥟🥟🥟🥟🥟🥟🥟🥟🥟🥟🥟🥟----------Q34-----------🥟🥟🥟🥟🥟🥟🥟🥟🥟🥟🥟🥟🥟🥟🥟🥟🥟🥟🥟🥟🥟🥟🥟🥟🥟🥟
//public class Exam {
//    public static void main(String[] args) {
//        int arr[] = new int [5];
//
//        System.out.print(arr);  //garbage value or address will be printed
//    }
//}
//〰️〰️〰️〰️〰️〰️〰️〰️〰️〰️〰️〰️〰️〰️〰️〰️〰️〰️〰️〰️〰️〰️〰️〰️〰️〰️〰️〰️〰️〰️〰️〰️〰️〰️〰️〰️〰️〰️〰️〰️〰️〰️〰️〰️〰️〰️〰️〰️〰️〰️〰️〰️






//🦈🦈🦈🦈🦈🦈🦈🦈🦈🦈🦈🦈🦈🦈🦈🦈🦈🦈🦈🦈----------Q36-----------🦈🦈🦈🦈🦈🦈🦈🦈🦈🦈🦈🦈🦈🦈🦈🦈🦈🦈🦈🦈🦈🦈🦈
//public class Exam
//{
//    public static void main(String args[]) {
//        int arr[] = new int[] { 0, 1, 2, 3, 4, 5, 6, 7, 8, 9 };
//        int n = 6;
//        n = arr[arr[n] / 2];
//        System.out.println(arr[n] / 2);  //1
//    }
//}
//〰️〰️〰️〰️〰️〰️〰️〰️〰️〰️〰️〰️〰️〰️〰️〰️〰️〰️〰️〰️〰️〰️〰️〰️〰️〰️〰️〰️〰️〰️〰️〰️〰️〰️〰️〰️〰️〰️〰️〰️〰️〰️〰️〰️〰️〰️〰️〰️〰️〰️〰️〰️〰️〰️




//🎗️🎗️🎗️🎗️🎗️🎗️🎗️🎗️🎗️🎗️🎗️🎗️🎗️🎗️🎗️🎗️🎗️🎗️🎗----------Q38-----------🎗️🎗️🎗️🎗️🎗️🎗️🎗️🎗️🎗️🎗️🎗️🎗️🎗️🎗️🎗️🎗️🎗️🎗️🎗️🎗️🎗️🎗️🎗️🎗️
//class Q38
//{
//    public static void main(String args[])
//    {
//        int array_variable[][] = { { 1, 2, 3 }, { 4, 5, 6 }, { 7, 8, 9 } };
//        int sum = 0;
//        for (int i = 0; i < 3; ++i)
//            for (int j = 0; j < 3; ++j)
//                sum = sum + array_variable[i][j];
//        System.out.print(sum / 5);
//    }
//}
//〰️〰️〰️〰️〰️〰️〰️〰️〰️〰️〰️〰️〰️〰️〰️〰️〰️〰️〰️〰️〰️〰️〰️〰️〰️〰️〰️〰️〰️〰️〰️〰️〰️〰️〰️〰️〰️〰️〰️〰️〰️〰️〰️〰️〰️〰️〰️〰️〰️〰️〰️〰️〰️




//✈️✈️✈️✈️✈️✈️✈️✈️✈️✈️✈️✈️✈️✈️--------------Q39------------✈️✈️✈️✈️✈️✈️✈️✈️✈️✈️✈️✈️✈️✈️✈️✈️✈️✈️✈️✈️️✈️✈️✈️️✈️✈️✈️✈️
//class Q39 {
//    public static void main(String args[])
//    {
//        int g = 3;
//        System.out.print(++g * 8);  //32
//    }
//}
//〰️〰️〰️〰️〰️〰️〰️〰️〰️〰️〰️〰️〰️〰️〰️〰️〰️〰️〰️〰️〰️〰️〰️〰️〰️〰️〰️〰️〰️〰️〰️〰️〰️〰️〰️〰️〰️〰️〰️〰️〰️〰️〰️〰️〰️〰️〰️〰️〰️〰️〰️〰️〰️





//✔️✔️✔️✔️✔️✔️✔️✔️✔️✔️✔️✔️✔️✔️✔️✔️✔----------Q47-----------✔️✔️✔️✔️✔️✔️✔️✔️✔️✔️✔️✔️✔️✔️✔️✔️✔️✔️✔️✔️✔️✔️✔️✔️
//class Q47 {
//    public static void main(String----------Q47-----------[] args) {
//        short x = 10;
//        x = x * 5;
//        System.out.print(x);  //java: incompatible types: possible lossy conversion from int to short
//    }
//}
//〰️〰️〰️〰️〰️〰️〰️〰️〰️〰️〰️〰️〰️〰️〰️〰️〰️〰️〰️〰️〰️〰️〰️〰️〰️〰️〰️〰️〰️〰️〰️〰️〰️〰️〰️〰️〰️〰️〰️〰️〰️〰️〰️〰️〰️〰️〰️〰️〰️〰️〰️〰️〰️






//🥟🥟🥟🥟🥟🥟🥟🥟🥟🥟🥟🥟🥟🥟🥟🥟----------Q48-----------🥟🥟🥟🥟🥟🥟🥟🥟🥟🥟🥟🥟🥟🥟🥟🥟🥟🥟🥟🥟🥟🥟🥟🥟🥟🥟
//class Q48 {
//    public static void main(String[] args) {
//        int[] a = { 0, 2, 4, 1, 3 };
//        for (int i = 0; i < a.length; i++) {
//            a[i] = a[(a[i] + 3) % a.length];
//            System.out.println(a[i]);
//        }
//    }
//}
//〰️〰️〰️〰️〰️〰️〰️〰️〰️〰️〰️〰️------------------NOTE FOR ---------Q48-----------〰️〰️〰️〰️〰️〰️〰️〰️〰️〰️〰️〰️〰️〰️〰️〰️〰️〰️〰️
//Initially, the array a contains the values { 0, 2, 4, 1, 3 }.
//        In the first iteration of the loop, i is 0, so a[i] is 0.
//        The expression (a[i] + 3) % a.length evaluates to (0 + 3) % 5, which is 3.
//        So a[0] is set to a[3], which is 1. Now a contains the values { 1, 2, 4, 1, 3 }.
//        In the second iteration of the loop, i is 1, so a[i] is 2.
//        The expression (a[i] + 3) % a.length evaluates to (2 + 3) % 5, which is 0.
//        So a[1] is set to a[0], which is 1. Now a contains the values { 1, 1, 4, 1, 3 }.
//        In the third iteration of the loop, i is 2, so a[i] is 4.
//        The expression (a[i] + 3) % a.length evaluates to (4 + 3) % 5, which is 2.
//        So a[2] is set to a[2], which is 4. Now a contains the values { 1, 1, 4, 1, 3 }.
//        In the fourth iteration of the loop, i is 3, so a[i] is 1.
//        The expression (a[i] + 3) % a.length evaluates to (1 + 3) % 5, which is 4.
//        So a[3] is set to a[4], which is 3. Now a contains the values { 1, 1, 4, 3, 3 }.
//        In the fifth and final iteration of the loop, i is 4, so a[i] is 3.
//        The expression (a[i] + 3) % a.length evaluates to (3 + 3) % 5, which is 1.
//        So a[4] is set to a[1], which is 1. Now a contains the values { 1, 1, 4, 3, 1 }.
//〰️〰️〰️〰️〰️〰️〰️〰️〰️〰️〰️〰️〰️〰️〰️〰️〰️〰️〰️〰️〰️〰️〰️〰️〰️〰️〰️〰️〰️〰️〰️〰️〰️〰️〰️〰️〰️〰️〰️〰️〰️〰️〰️〰️〰️〰️〰️〰️〰️〰️〰️〰️〰️






//🎗️🎗️🎗️🎗️🎗️🎗️🎗️🎗️🎗️🎗️🎗️🎗️🎗️🎗️🎗️🎗️----------Q50----------️🎗️🎗️🎗️🎗️🎗️🎗️🎗️🎗️🎗️🎗️🎗️🎗️🎗️🎗️🎗️🎗️🎗️🎗️🎗️🎗️🎗️🎗️🎗️🎗️🎗️🎗️
//class Q50 {
//    public static void main(String[] args) {
//        String str = "abcde";
//
//        //Here in this inbuilt method 1st index is inclusive & 2nd is exclusive
//        //it means it will print bc
//        System.out.println(str.substring(1, 3));
//    }
//}
//〰️〰️〰️〰️〰️〰️〰️〰️〰️〰️〰️〰️〰️〰️〰️〰️〰️〰️〰️〰️〰️〰️〰️〰️〰️〰️〰️〰️〰️〰️〰️〰️〰️〰️〰️〰️〰️〰️〰️〰️〰️〰️〰️〰️〰️〰️〰️〰️〰️〰️〰️〰️〰️





//✈️✈️✈️✈️✈️✈️✈️✈️✈️✈️✈️✈️✈️✈️--------------Lecture.Q51------------✈️✈️✈️✈️✈️✈️✈️✈️✈️✈️✈️✈️✈️✈️✈️✈️✈️✈️✈️✈️️✈️✈️✈️️✈️✈️✈️✈️
class Q51 {
    public static void main(String[] args) {
        String str = "Hellow";

        System.out.println(str.indexOf('t'));   //-1
    }
}
//〰️〰️〰️〰️〰️〰️〰️〰️〰️〰️〰️〰️〰️〰️〰️〰️〰️〰️〰️〰️〰️〰️〰️〰️〰️〰️〰️〰️〰️〰️〰️〰️〰️〰️〰️〰️〰️〰️〰️〰️〰️〰️〰️〰️〰️〰️〰️〰️〰️〰️〰️〰️〰️






//🧱🧱🧱🧱🧱🧱🧱🧱🧱🧱🧱🧱🧱🧱🧱🧱--------------Q52------------🧱🧱🧱🧱🧱🧱🧱🧱🧱🧱🧱🧱🧱🧱🧱🧱🧱🧱🧱🧱🧱🧱🧱🧱🧱
//class Q52 {
//    public static void main(String args[]){
//        String str1 = "one";
//        String str2 = "two";
//        System.out.println(str1.concat(str2));  //onetwo
//    }
//}
//〰️〰️〰️〰️〰️〰️〰️〰️〰️〰️〰️〰️〰️〰️〰️〰️〰️〰️〰️〰️〰️〰️〰️〰️〰️〰️〰️〰️〰️〰️〰️〰️〰️〰️〰️〰️〰️〰️〰️〰️〰️〰️〰️〰️〰️〰️〰️〰️〰️〰️〰️〰️〰️







//🎙️🎙️🎙️🎙️🎙️🎙️🎙️🎙️🎙️🎙️🎙️🎙️🎙️🎙️🎙--------------Q53------------️🎙️🎙️🎙️🎙️🎙️🎙️🎙️🎙️🎙️🎙️🎙️🎙️🎙️🎙️🎙️🎙️🎙️🎙️🎙️🎙️🎙️🎙️🎙️🎙️🎙️🎙️🎙
//public class Q53 {
//    public static void main(String[] args) {
//        int ++a = 100;
//        System.out.println(++a);  //compile error as we cant start a variable name with ++
//    }
//}
//〰️〰️〰️〰️〰️〰️〰️〰️〰️〰️〰️〰️〰️〰️〰️〰️〰️〰️〰️〰️〰️〰️〰️〰️〰️〰️〰️〰️〰️〰️〰️〰️〰️〰️〰️〰️〰️〰️〰️〰️〰️〰️〰️〰️〰️〰️〰️〰️〰️〰️〰️〰️〰️
//〰️〰️〰️〰️〰️〰️〰️〰️〰️〰️〰️〰️〰️〰️〰️〰️〰----------END------------️〰️〰️〰️〰️〰️〰️〰️〰️〰️〰️〰️〰️〰️〰️〰️〰️〰️〰️〰️〰️〰️〰️〰️〰️〰️〰️